# Pandas 학습

1. 데이터 분석을 위한 모듈 : 절대적(중학생 과제 작품으로도 사용)
2. excel과 가장 큰 차이점 : Pandas는 대용량 데이터 처리가 가능
3. 데이터 분석 및 데이터 가공에 절대적으로 사용되는 library
4. 주요 학습 내용
> 1. DataFrame - excel의 다수의 컬럼들을 보유한 table과 동일하다 간주
> 2. series - DataFrame을 구성하는 column 간주

**참고**

주피터 노트북 익스텐션을 활용하여 생산성 높이기
>pip install jupyter_contrib_nbextensions && jupyter contrib nbextension install

사용하는 기능

pep8 코딩 컨벤션 체크 및 포멧 정리 기능

목차

In [4]:
# !pip install jupyter_contrib_nbextensions && jupyter contrib nbextension install

## 기초 익히기
> 이미 존재하는 파일의 내용으로 DataFrame 생성하기 <br>
> 중복 데이터 제거 <br>
> 결측시 처리

## DataFrame  & Series 구조 
> https://pandas.pydata.org/docs/getting_started/index.html <br>

In [2]:
# 전처리를 위한 library import

# as 키워드는 library 별칭 부여 : pd(판다스) 관습적으로 사용

import pandas as pd
import numpy as np

In [2]:
!pip show pandas

Name: pandas
Version: 1.1.3
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: https://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: c:\users\playdata\anaconda3\lib\site-packages
Requires: python-dateutil, numpy, pytz
Required-by: statsmodels, seaborn

In [8]:
df = pd.DataFrame(
    {
        "Name": [
            "장수정",
            "유지현",
            "이성규"
        ],
        "Age": [25, 29, 27],
        "Sex": ["female", "female", "male"],
    }
)
df

  Name  Age     Sex
0  장수정   25  female
1  유지현   29  female
2  이성규   27    male

In [10]:
test = pd.DataFrame(
    {
        "Name": [
            "강호동",
            "이수근",
            "은지원",
            "조규현",
            "송민호",
            "피오"
        ],
        "연령대": [50, 40, 40, 30, 20, 20]
    }
)
test

  Name  연령대
0  강호동   50
1  이수근   40
2  은지원   40
3  조규현   30
4  송민호   20
5   피오   20

기초 익히기

In [5]:
# 시리즈 - 정수값으로 생성시 자동으로 int64 (64비트 저장 가능한 정수)
# 시리즈 생성 문법

s = pd.Series([1, 2, 3])    # 시리즈 객체
s

0    1
1    2
2    3
dtype: int64

In [6]:
type(s)

pandas.core.series.Series

In [7]:
# 시리즈 객체가 보유한 데이터
s.values

array([1, 2, 3], dtype=int64)

In [8]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [12]:
# 결측치 - 데이터값이 없음을 의미, nan(Not a Number)
# Not a Number : js에서 숫자가 아님을 의미하는 표현법
# python에선 결측치 의미

# 명시적으로 시리즈에 결측치 적용
# numpy api 결측치 표현

# 데이터를 관리하기 위해서는 간혹 결측치도 임의로 생성해야 할 경우도 있음.
s = pd.Series([1, np.nan, 3, 5, 6, np.nan])
s

0    1.0
1    NaN
2    3.0
3    5.0
4    6.0
5    NaN
dtype: float64

In [14]:
# 시리즈가 보유하고 있는 결측치를 제외한 유효한 데이터 개수 counting
s.count()

4

In [29]:
# 가령 데이터로 연산 작업등을 수행
# 최사의 output을 위해서 결측치 처리(삭제? 대체?(평균?, 중앙값?, 최빈값?..))

s.fillna(0)    # 결측치를 0으로 치환한 새로운 시리즈 생성

s = s.fillna(0)
s

0    1.0
1    0.0
2    3.0
3    5.0
4    6.0
5    0.0
dtype: float64

In [34]:
s = pd.Series([1, np.nan, 3, 5, 6, np.nan])
print(s)

s = s.fillna(10)
print(s)

0    1.0
1    NaN
2    3.0
3    5.0
4    6.0
5    NaN
dtype: float64
0     1.0
1    10.0
2     3.0
3     5.0
4     6.0
5    10.0
dtype: float64

In [33]:
# 결측치 삭제 : dropna()
s = pd.Series([1, np.nan, 3, 5, 6, np.nan])
print(s)

s = s.dropna()
print(s)

0    1.0
1    NaN
2    3.0
3    5.0
4    6.0
5    NaN
dtype: float64
0    1.0
2    3.0
3    5.0
4    6.0
dtype: float64

## 날짜와 문자열 데이터 다루기 


- Python의 datetime모듈

>date : 연, 월, 일

>time : 시간, 분, 초, 마이크로초(백만분의 1초)

>datetime : date와 time요소

- Pandas의 Timestamp

>날짜와 시간 모두 포함 : 나노초(10억분의 1초) 단위의 정밀도


- timedelta

>날짜의 덧셈과 뺄셈에 유용

### 특정 날짜를 기준으로 DataFrame생성해 보기

In [35]:
# 6일치의 날짜데이터 생성
# data_range(시작일, 범위) : 시작일로 부터 해당 범위 날짜까지 자동 생성

datas = pd.date_range('20210628', periods=6)
datas

DatetimeIndex(['2021-06-28', '2021-06-29', '2021-06-30', '2021-07-01',
               '2021-07-02', '2021-07-03'],
              dtype='datetime64[ns]', freq='D')

**날짜를 index로 적용해서 DataFrame 객체 생성**

In [38]:
type(datas)

pandas.core.indexes.datetimes.DatetimeIndex

In [40]:
# 6 by 4 : 6행 4열(6X4) 구조의 DataFrame 생성, 데이터는 자동 생성되는 난수값 활용

# 실수의 난수 발생 함수 : 2행 3열의 실수 난수
np.random.randn(2,3)

array([[-0.03996188,  0.50004898, -0.87998342],
       [-0.12892048,  0.35244818,  0.83506086]])

In [55]:
# 정수의 난수 발생 함수 : 0~11까지의 정수
np.random.randint(12)

0

In [57]:
# randn() : 구조 포함된 난수 발생
# randint() : 범위에 해당하는 하나의 정수값만 발생

np.random.randint(2,3)    # 2~3 이전까지의 정수 난수 발생

2

In [65]:
# 6행 4열의 구조로 날짜를 보유한 datas 변수값을 index로 구성하는 DataFrame 객체

# Pandas로 데이터 처리시에넌 Numpy 모듈을 필수

df = pd.DataFrame(np.random.randn(6,4) , index=datas)
df

                   0         1         2         3
2021-06-28  0.842825  1.276554 -1.644564  0.360657
2021-06-29 -0.312204  1.232231 -0.598609  0.118986
2021-06-30  1.408662  0.874578 -0.108960  0.914983
2021-07-01  0.188866 -0.491467 -0.253818 -0.660988
2021-07-02  0.547894  0.142700 -0.303367  1.079205
2021-07-03 -0.976454  0.672891  0.354794 -0.421470

In [67]:
# 컬럼명 가공

df = pd.DataFrame(np.random.randn(6, 4), index=datas,
                  columns=['a', 'b', 'c', 'd'])
df

                   a         b         c         d
2021-06-28 -1.774312 -2.236981  0.981705  0.167159
2021-06-29 -1.072687 -1.231884 -0.742103 -0.255322
2021-06-30  0.332112 -0.908324 -0.782778 -1.415063
2021-07-01 -0.232838 -0.304731 -1.507826 -2.092910
2021-07-02  0.691238 -0.262096 -1.015540 -1.271089
2021-07-03  0.179959 -0.885243  0.491010 -0.639812

In [71]:
# df의 value
df.values

array([[-1.77431195, -2.23698113,  0.98170492,  0.16715875],
       [-1.07268695, -1.23188375, -0.74210284, -0.2553224 ],
       [ 0.33211169, -0.90832385, -0.78277794, -1.41506341],
       [-0.23283766, -0.30473109, -1.50782632, -2.0929098 ],
       [ 0.69123758, -0.26209553, -1.01553959, -1.27108907],
       [ 0.17995942, -0.88524277,  0.49100978, -0.63981248]])

In [72]:
# df의 index
df.index

DatetimeIndex(['2021-06-28', '2021-06-29', '2021-06-30', '2021-07-01',
               '2021-07-02', '2021-07-03'],
              dtype='datetime64[ns]', freq='D')

In [74]:
# df의 columns
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [76]:
# 차후에 ML/DL 시에 데이터 구조를 한눈에 자주 봐야 함

df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2021-06-28 to 2021-07-03
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       6 non-null      float64
 1   b       6 non-null      float64
 2   c       6 non-null      float64
 3   d       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [79]:
# 기초 통계 확인 가능한 함수
# 가령 빌게이츠 급여가 포함된 동네 주민의 급여들이 활용 데이터라 할 경우
# 이상치? 결측치? 확인을 위해서 기초 통계를 보고 max()에서 빌게이츠 급여와 75% 지정 갭이 너무 크면
# 크면 이상하다(이상치)로 간주하는 분석 기법도 있음

df.describe()

              a         b         c         d
count  6.000000  6.000000  6.000000  6.000000
mean  -0.312755 -0.971543 -0.429255 -0.917840
std    0.936659  0.725053  0.955782  0.830212
min   -1.774312 -2.236981 -1.507826 -2.092910
25%   -0.862725 -1.150994 -0.957349 -1.379070
50%   -0.026439 -0.896783 -0.762440 -0.955451
75%    0.294074 -0.449859  0.182732 -0.351445
max    0.691238 -0.262096  0.981705  0.167159

In [80]:
df = pd.DataFrame(np.random.randn(6, 4), index=datas,
                  columns=['a', 'b', 'c', 'd'])
df

                   a         b         c         d
2021-06-28 -0.246303 -2.090396  0.321789  0.163684
2021-06-29 -1.443261 -1.462814 -0.005826  0.197360
2021-06-30 -0.046384  1.099455  0.260576 -0.572092
2021-07-01 -1.772285  0.179513 -0.718852  0.834937
2021-07-02  0.562736 -0.935311  0.655002 -1.725082
2021-07-03  0.932531  0.512834 -0.107772  1.667454

In [83]:
# b 컬럼에 대한 오름차순 정렬 설정
# 오름차순 : ascending=True
# 내림차순 : ascending=False

df.sort_values(by='b', ascending=True)

                   a         b         c         d
2021-06-28 -0.246303 -2.090396  0.321789  0.163684
2021-06-29 -1.443261 -1.462814 -0.005826  0.197360
2021-07-02  0.562736 -0.935311  0.655002 -1.725082
2021-07-01 -1.772285  0.179513 -0.718852  0.834937
2021-07-03  0.932531  0.512834 -0.107772  1.667454
2021-06-30 -0.046384  1.099455  0.260576 -0.572092

In [86]:
# 특정 컬럼들 값만 도출해 보기
# [] 연산자와 컬럼명으로 컬럼 도출

df['a']

2021-06-28   -0.246303
2021-06-29   -1.443261
2021-06-30   -0.046384
2021-07-01   -1.772285
2021-07-02    0.562736
2021-07-03    0.932531
Freq: D, Name: a, dtype: float64

In [92]:
# dot 연산자를 활용하여 특정 컬럼 검색

df.a

2021-06-28   -0.246303
2021-06-29   -1.443261
2021-06-30   -0.046384
2021-07-01   -1.772285
2021-07-02    0.562736
2021-07-03    0.932531
Freq: D, Name: a, dtype: float64

In [88]:
df['a','b']    # error

KeyError: ('a', 'b')

In [90]:
# 하나 이상의 컬럼들은 list 구조로 적용
# df[] : 특정 컬럼을 도출함을 의미하는 문법
# ['a','b'] - a와 b 컬럼 의미
# 다중 컬럼 검색시에는 반드시 list로 변환해서 작업

df[['a','b']]

                   a         b
2021-06-28 -0.246303 -2.090396
2021-06-29 -1.443261 -1.462814
2021-06-30 -0.046384  1.099455
2021-07-01 -1.772285  0.179513
2021-07-02  0.562736 -0.935311
2021-07-03  0.932531  0.512834

### file로 부터 데이터 read해서 date 타입 이해하기

In [95]:
# index로 데이터 검색(도출)
df.index

DatetimeIndex(['2021-06-28', '2021-06-29', '2021-06-30', '2021-07-01',
               '2021-07-02', '2021-07-03'],
              dtype='datetime64[ns]', freq='D')

In [97]:
# : 기준으로 slicing해서 데이터 도출

df['2021-06-28':'2021-07-01']    # 시작일~끝일자

                   a         b         c         d
2021-06-28 -0.246303 -2.090396  0.321789  0.163684
2021-06-29 -1.443261 -1.462814 -0.005826  0.197360
2021-06-30 -0.046384  1.099455  0.260576 -0.572092
2021-07-01 -1.772285  0.179513 -0.718852  0.834937

In [99]:
# index의 위치값인 순번(index)으로 데이터 도출
# 0 부터 4-1 즉 4 이전까지 의미

df[0:4]

                   a         b         c         d
2021-06-28 -0.246303 -2.090396  0.321789  0.163684
2021-06-29 -1.443261 -1.462814 -0.005826  0.197360
2021-06-30 -0.046384  1.099455  0.260576 -0.572092
2021-07-01 -1.772285  0.179513 -0.718852  0.834937

In [101]:
df[0:2,0:2]

TypeError: '(slice(0, 2, None), slice(0, 2, None))' is an invalid key

In [109]:
# iloc 라는 속성을 통해서 검색 - index location의 약어
# iloc[indexs, colums]

df.iloc[0:2,0:2]

                   a         b
2021-06-28 -0.246303 -2.090396
2021-06-29 -1.443261 -1.462814

In [11]:
# 01.date_data.csv

# csv 파일의 내용을 read하면서 DataFrame 객체로 생성

# DataFrame 객체의 장점은 다양한 함수가 있기 때문에 조작 및 정제 가능

# 가정사항 : csv 파일은 제공 받음, 단 raw 는 보존, 정제 및 분석을 위해서는 최적인 상태로 가공 필요 
# 문제점 찾기 - \t?, at ?,

# 사용 빈도가 매우 높음
df = pd.read_csv('dataset/01.date_data.csv')
df

   Name             Birth                  email
0   이순신   2021-01-01 9:10       happy@gmail.com
1   홍길동   2021-01-08 9:20         1004@NAVER.COM
2   유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3    이이  2021-02-02 11:40        \tlee@gmail.com
4    김구  2021-02-28 15:10         kim@daum.net\t
5   윤봉길  2021-04-10 19:20        yeon@daum.ac.kr
6   강감찬  2021-06-30 21:20          kkc@gmail.com
7  신사임당  2021-07-20 23:30     monther@NAVER.COM
8  을지문덕  2021-08-28 11:48          ygmd@daum.net
9   유재석   2021-09-01 3:12       yjs at gmail.com

In [13]:
# dtypes : 문자열 타입을 object 타입으로 표현

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Birth   10 non-null     object
 2   email   10 non-null     object
dtypes: object(3)
memory usage: 368.0+ bytes

In [14]:
# format='%Y-%m-%d %H:%M:%S'
df.columns

Index(['Name', 'Birth', 'email'], dtype='object')

In [16]:
df.values

array([['이순신', '2021-01-01 9:10', 'happy@gmail.com '],
       ['홍길동', '2021-01-08 9:20', '  1004@NAVER.COM'],
       ['유관순', '2021-02-01 10:20', ' Iron at yahoo.co.kr '],
       ['이이', '2021-02-02 11:40', '\tlee@gmail.com'],
       ['김구', '2021-02-28 15:10', 'kim@daum.net\t'],
       ['윤봉길', '2021-04-10 19:20', 'yeon@daum.ac.kr'],
       ['강감찬', '2021-06-30 21:20', 'kkc@gmail.com'],
       ['신사임당', '2021-07-20 23:30', 'monther@NAVER.COM '],
       ['을지문덕', '2021-08-28 11:48', '    ygmd@daum.net'],
       ['유재석', '2021-09-01 3:12', 'yjs at gmail.com']], dtype=object)

In [17]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [19]:
df['Birth']

0     2021-01-01 9:10
1     2021-01-08 9:20
2    2021-02-01 10:20
3    2021-02-02 11:40
4    2021-02-28 15:10
5    2021-04-10 19:20
6    2021-06-30 21:20
7    2021-07-20 23:30
8    2021-08-28 11:48
9     2021-09-01 3:12
Name: Birth, dtype: object

In [21]:
df.Birth

0     2021-01-01 9:10
1     2021-01-08 9:20
2    2021-02-01 10:20
3    2021-02-02 11:40
4    2021-02-28 15:10
5    2021-04-10 19:20
6    2021-06-30 21:20
7    2021-07-20 23:30
8    2021-08-28 11:48
9     2021-09-01 3:12
Name: Birth, dtype: object

In [24]:
# object 즉 문자열 타입을 datetime 타입으로 변환 하는 구조

df['Birth'] = pd.to_datetime(df['Birth'], format='%Y-%m-%d %H:%M:%S')
df

   Name               Birth                  email
0   이순신 2021-01-01 09:10:00       happy@gmail.com
1   홍길동 2021-01-08 09:20:00         1004@NAVER.COM
2   유관순 2021-02-01 10:20:00   Iron at yahoo.co.kr
3    이이 2021-02-02 11:40:00        \tlee@gmail.com
4    김구 2021-02-28 15:10:00         kim@daum.net\t
5   윤봉길 2021-04-10 19:20:00        yeon@daum.ac.kr
6   강감찬 2021-06-30 21:20:00          kkc@gmail.com
7  신사임당 2021-07-20 23:30:00     monther@NAVER.COM
8  을지문덕 2021-08-28 11:48:00          ygmd@daum.net
9   유재석 2021-09-01 03:12:00       yjs at gmail.com

In [25]:
df['Birth']

0   2021-01-01 09:10:00
1   2021-01-08 09:20:00
2   2021-02-01 10:20:00
3   2021-02-02 11:40:00
4   2021-02-28 15:10:00
5   2021-04-10 19:20:00
6   2021-06-30 21:20:00
7   2021-07-20 23:30:00
8   2021-08-28 11:48:00
9   2021-09-01 03:12:00
Name: Birth, dtype: datetime64[ns]

In [28]:
# '2019-01-01' : 문자열
# pd.to_datetime('2019-01-01') : 문자열을 datetime 즉 날짜 표현 타입으로 변환
# - : 경과일

eday = df['Birth'] - pd.to_datetime('2019-01-01')
eday

0   731 days 09:10:00
1   738 days 09:20:00
2   762 days 10:20:00
3   763 days 11:40:00
4   789 days 15:10:00
5   830 days 19:20:00
6   911 days 21:20:00
7   931 days 23:30:00
8   970 days 11:48:00
9   974 days 03:12:00
Name: Birth, dtype: timedelta64[ns]

###  경과일 계산

- timedelta64[??]  : 날짜의 덧셈과 뺄셈에 유용
  - Y : 연 
  - M : 월 
  - D : 일 
  - m : 분 
  - s : 초

In [31]:
# 경과일을 day 즉 일을 기준으로 일 데이터만 도출
# 아쉬운 점 : .(소수점) 표현 의미 없을 경우 삭제 시도 astype() 함수로 체이닝 기술 적용
eday.astype('timedelta64[D]')

0    731.0
1    738.0
2    762.0
3    763.0
4    789.0
5    830.0
6    911.0
7    931.0
8    970.0
9    974.0
Name: Birth, dtype: float64

In [33]:
eday.astype('timedelta64[Y]')

0    2.0
1    2.0
2    2.0
3    2.0
4    2.0
5    2.0
6    2.0
7    2.0
8    2.0
9    2.0
Name: Birth, dtype: float64

In [35]:
eday.astype('timedelta64[M]')

0    24.0
1    24.0
2    25.0
3    25.0
4    25.0
5    27.0
6    29.0
7    30.0
8    31.0
9    32.0
Name: Birth, dtype: float64

In [36]:
# 최종적으로 int로 정제
eday.astype('timedelta64[M]').astype('int')

0    24
1    24
2    25
3    25
4    25
5    27
6    29
7    30
8    31
9    32
Name: Birth, dtype: int32

## 인덱서(indexer)

### iloc(index location)
- 데이터 프레임의 부분집합 선택을 위한 도구
- iloc는 정수로만 선택
- 여러 개의 정수 위치를 선택하려면 리스트 전달
- 동일한 간격으로 선택하려면 슬라이스 표기
- iloc[index] or iloc[index, column]

In [37]:
df = pd.read_csv('dataset/01.date_data.csv')
df

   Name             Birth                  email
0   이순신   2021-01-01 9:10       happy@gmail.com
1   홍길동   2021-01-08 9:20         1004@NAVER.COM
2   유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3    이이  2021-02-02 11:40        \tlee@gmail.com
4    김구  2021-02-28 15:10         kim@daum.net\t
5   윤봉길  2021-04-10 19:20        yeon@daum.ac.kr
6   강감찬  2021-06-30 21:20          kkc@gmail.com
7  신사임당  2021-07-20 23:30     monther@NAVER.COM
8  을지문덕  2021-08-28 11:48          ygmd@daum.net
9   유재석   2021-09-01 3:12       yjs at gmail.com

In [38]:
df.iloc[2]

Name                       유관순
Birth         2021-02-01 10:20
email     Iron at yahoo.co.kr
Name: 2, dtype: object

In [50]:
df.iloc[0,0]

'이순신'

In [43]:
df.iloc[1,1]

'2021-01-08 9:20'

In [51]:
df.head()    # DataFrame의 앞 부분 영역 5개의 index 반환

  Name             Birth                  email
0  이순신   2021-01-01 9:10       happy@gmail.com
1  홍길동   2021-01-08 9:20         1004@NAVER.COM
2  유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3   이이  2021-02-02 11:40        \tlee@gmail.com
4   김구  2021-02-28 15:10         kim@daum.net\t

In [58]:
df.iloc[1:3,0]

1    홍길동
2    유관순
Name: Name, dtype: object

In [59]:
df.iloc[4,2]

'kim@daum.net\t'

In [60]:
# index 1~2까지의 모든 컬럼(DataFrame 관점에선 시리즈) 검색
df.iloc[1:3,:]

  Name             Birth                  email
1  홍길동   2021-01-08 9:20         1004@NAVER.COM
2  유관순  2021-02-01 10:20   Iron at yahoo.co.kr

In [61]:
df = pd.read_csv('dataset/01.date_data.csv')
df.tail(3)

   Name             Birth               email
7  신사임당  2021-07-20 23:30  monther@NAVER.COM
8  을지문덕  2021-08-28 11:48       ygmd@daum.net
9   유재석   2021-09-01 3:12    yjs at gmail.com

In [62]:
# 모든 row들 이면서 Name, Birth 시리즈 값만 반환
df.loc[:,['Name', 'Birth']]

   Name             Birth
0   이순신   2021-01-01 9:10
1   홍길동   2021-01-08 9:20
2   유관순  2021-02-01 10:20
3    이이  2021-02-02 11:40
4    김구  2021-02-28 15:10
5   윤봉길  2021-04-10 19:20
6   강감찬  2021-06-30 21:20
7  신사임당  2021-07-20 23:30
8  을지문덕  2021-08-28 11:48
9   유재석   2021-09-01 3:12

### loc 속성

- 데이터들을 slicing 하는 기술
- loc[index, columns]
- loc는 레이블로만 선택
- 여러 개의 레이블을 선택하려면 리스트 전달
- 동일한 간격으로 선택하려면 슬라이스 표기 사용
- 마지막 레이블까지 포함

In [63]:
df = pd.read_csv('dataset/01.date_data.csv')
df

   Name             Birth                  email
0   이순신   2021-01-01 9:10       happy@gmail.com
1   홍길동   2021-01-08 9:20         1004@NAVER.COM
2   유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3    이이  2021-02-02 11:40        \tlee@gmail.com
4    김구  2021-02-28 15:10         kim@daum.net\t
5   윤봉길  2021-04-10 19:20        yeon@daum.ac.kr
6   강감찬  2021-06-30 21:20          kkc@gmail.com
7  신사임당  2021-07-20 23:30     monther@NAVER.COM
8  을지문덕  2021-08-28 11:48          ygmd@daum.net
9   유재석   2021-09-01 3:12       yjs at gmail.com

In [65]:
# 데이터 수정
print(df.iloc[0,0])
print(df.loc[0, 'Name'])

이순신
이순신

In [66]:
df.loc[0, 'Name'] = '김순신'
df.head()

  Name             Birth                  email
0  김순신   2021-01-01 9:10       happy@gmail.com
1  홍길동   2021-01-08 9:20         1004@NAVER.COM
2  유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3   이이  2021-02-02 11:40        \tlee@gmail.com
4   김구  2021-02-28 15:10         kim@daum.net\t

- file로 부터 데이터 read해서 DataFrame
- DataFrame의 특정 데이터값 착출
- DataFrame의 특정 데이터값 수정
- 새로운 Series 추가
- 결측치 처리대체(fillna())/삭제(dropma())

### 이미 존재하는 파일의 내용을 기반으로 DataFrame 생성하기

In [73]:
df = pd.read_csv('dataset/02.friends.csv')
df

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [70]:
# 새로운 시리즈(컬럼) 추가

df = pd.read_csv('dataset/01.date_data.csv')
df['age'] = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
df

   Name             Birth                  email  age
0   이순신   2021-01-01 9:10       happy@gmail.com    10
1   홍길동   2021-01-08 9:20         1004@NAVER.COM   20
2   유관순  2021-02-01 10:20   Iron at yahoo.co.kr    30
3    이이  2021-02-02 11:40        \tlee@gmail.com   40
4    김구  2021-02-28 15:10         kim@daum.net\t   50
5   윤봉길  2021-04-10 19:20        yeon@daum.ac.kr   60
6   강감찬  2021-06-30 21:20          kkc@gmail.com   70
7  신사임당  2021-07-20 23:30     monther@NAVER.COM    80
8  을지문덕  2021-08-28 11:48          ygmd@daum.net   90
9   유재석   2021-09-01 3:12       yjs at gmail.com  100

In [71]:
# 특정 Series 삭제 하는 구문

del df['age']    # java script와 동일
df

   Name             Birth                  email
0   이순신   2021-01-01 9:10       happy@gmail.com
1   홍길동   2021-01-08 9:20         1004@NAVER.COM
2   유관순  2021-02-01 10:20   Iron at yahoo.co.kr
3    이이  2021-02-02 11:40        \tlee@gmail.com
4    김구  2021-02-28 15:10         kim@daum.net\t
5   윤봉길  2021-04-10 19:20        yeon@daum.ac.kr
6   강감찬  2021-06-30 21:20          kkc@gmail.com
7  신사임당  2021-07-20 23:30     monther@NAVER.COM
8  을지문덕  2021-08-28 11:48          ygmd@daum.net
9   유재석   2021-09-01 3:12       yjs at gmail.com

In [77]:
df = pd.read_csv('dataset/03.friendsTab.txt')
print(df)
# 문제점 발견 : tab으로 데이터 구분(tab seperated valued[tsv]), 확장자 *.tsv
# txt 파일의 포멧은 문제가 없는데 DataFrame으로 변환시에 문제 발생
# 해결책 : read_csv에 구분자 속성으로 ,가 구분자가 아닌 tab 구분자로 명시
print('*******************')

df = pd.read_csv('dataset/03.friendsTab.txt', delimiter='\t')
print(df)

     이름\t나이\t직업\thobby
0  신동엽\t20\t연예인\tmusic
1     유재석\t41\t교수\tart
2   김새롬\t18\t학생\tstudy
3   이영자\t45\t상담사\ttalk
4   강호동\t38\t연예인\ttalk
*******************
    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [79]:
df = pd.read_csv('dataset/04.friendsTabNoHead.txt', delimiter='\t')
print(df)

# 문제점 : 데이터가 마치 header 처럼 쓰임
# 해결 : 새로운 컬럼명 추가

   신동엽  20  연예인  music
0  유재석  41   교수    art
1  김새롬  18   학생  study
2  이영자  45  상담사   talk
3  강호동  38  연예인   talk

In [81]:
df.columns

Index(['신동엽', '20', '연예인', 'music'], dtype='object')

In [83]:
# header가 없는 외부파일 read시에 header 미 적용 설정
# 데이터가 column으로 적용되지 않음

df = pd.read_csv('dataset/04.friendsTabNoHead.txt', delimiter='\t', header=None)
print(df)

     0   1    2      3
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [84]:
# header 즉 columns 정보 추가
# names 라는 속성으로 추가

df = pd.read_csv('dataset/04.friendsTabNoHead.txt', delimiter='\t',
                 header=None, names=['이름', 'age', 'job', 'hobby'])
print(df)

    이름  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [85]:
df

    이름  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [89]:
# sal 급여 시리즈 추가,따른 단 학생인 경우엔 급여는 no로 변환, non-학생은 yes 값으로 변환
# 값에 따른 데이터 적용(조건별 값 차별화)

# sal 이라는 컬럼에 0 값으로 적용
df['sal'] = 0
df

    이름  age  job  hobby  sal
0  신동엽   20  연예인  music    0
1  유재석   41   교수    art    0
2  김새롬   18   학생  study    0
3  이영자   45  상담사   talk    0
4  강호동   38  연예인   talk    0

In [97]:
# job이 학생을 제외한 모든 친구들은 sal에 yes
# 3항 연산자 : 조건식? 조건식이 true인 경우 실행, 조건식이 false인 경우 실행
df['job'] == '학생'

# 암기
# 삼항 연산식을 Numpy의 where 이라는 함수의 parameter로 적용시 syntax
# np.where(조건식, 조건식이 true경우 반환, 조건식이 false인 경우 반환)

df['sal'] = np.where(df['job'] != '학생', 'yes', 'no')
df

    이름  age  job  hobby  sal
0  신동엽   20  연예인  music  yes
1  유재석   41   교수    art  yes
2  김새롬   18   학생  study   no
3  이영자   45  상담사   talk  yes
4  강호동   38  연예인   talk  yes

### python의 데이터로 DataFrame 객체로 변환하기

- dict의 key를 DataFrame의 Series명으로 자동 변환
- 차후에 데이터 수집 및 관리시에 어떤 구조로 데이터를 수집하고 취합해야 하는지 설계 가능

In [68]:
# 딕셔너리들로 구성된 하나의 list

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'}]
type(friend_dict_list)

list

In [99]:
df = pd.DataFrame(friend_dict_list)
print(df)
print(type(df))

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
<class 'pandas.core.frame.DataFrame'>

### 중복 데이터 제거 기술

In [100]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [101]:
# 중복 데이터 여부 확인 가능한 함수
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [105]:
# df.duplicated() 결과 값으로 True였던 row 값 삭제
df.drop_duplicates()
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [106]:
# keep 속성으로 마지막 중복 데이터 유지하고 첫번째 데이터 삭제
# hint는 parameter에서 Shift + Tab 로 설정
df.drop_duplicates(keep='last')

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [107]:
# step02 - 속성으로 선별해서 삭제

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [109]:
# 원본 DataFrame에서 수정해서 새로 생성된 DataFrame 객체
# df 에 대입하지 않을 경우 원본 유지되는 구조

df.drop_duplicates('name', keep='last')

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [110]:
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [ ]:
# step03 - 동명이인일 경우에 선별해서 삭제

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': 50, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df

In [ ]:
# step04 - 원본 DataFrame 자체에 수정 사항 바로 반영하는 속성

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': 50, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df

In [111]:
df.drop_duplicates('name', keep='last')

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [112]:
# inplace= True : 원본에 실제 변경 사항을 여과없이 적용, 원본 수정
df.drop_duplicates('name', keep='last', inplace=True)
df

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

### 결측치 처리

In [114]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby': 'music'}]
df = pd.DataFrame(friend_dict_list)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [116]:
# index명 5라는 위치의 신동엽의 age는 결측치
# info() 로 non-null 값으로 결측치 여부 확인 가능

# 저 결측치를 어떻게 처리할까?
# age는 절대 결측치일리가 없음, 나이가 없는 친구가 없기 때문
# age의 Non은 어떻게 할까? 지울까? 대체?(평균? 중앙값? 최빈값?...)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     5 non-null      float64
 2   job     6 non-null      object
 3   hobby   6 non-null      object
dtypes: float64(1), object(3)
memory usage: 320.0+ bytes

In [130]:
# 결측치 어떤 값으로 치환?
# age의 평균을 구해서 df의 age 값이 결측치에 한해서만 평균값 적용

# df['age'].mean() - age의 평균
# fillna(결측치에 적용 될 데이터, inplace=True(갱신된내용원본에반영))
# 남성?여성? 빈도에 맞춰서 남성이 많다면 남성 평균으로만 적용

df['age'].fillna(df['age'].mean(), inplace=True)
df.fillna(value=0)

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽  32.4  연예인  music

In [122]:
# null(결측치, Nan와 동일한 표현) 값 확인 함수. 
# True 값을 표현하는 것은 Nan에 해당하는 데이터인 경우
df.isnull()

    name    age    job  hobby
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False   True  False  False

In [124]:
# age 시리즈에 대한 총합

df['age'].sum()

162.0

In [126]:
# age 시리즈에 대한 평균

df['age'].mean()

32.4

In [128]:
df['age'].max()

45.0

In [129]:
# 결측치 어떤 값으로 치환?
df['age'].fillna(df['age'].mean(), inplace=True)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽  32.4  연예인  music

### 그룹화 하기

In [178]:
# None 값을 0 값으로 치환

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df['age'].fillna(df['age'].mean(), inplace=True)
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽  32.4  연예인  music

In [134]:
df.groupby('job')

1. job 종류 확인 : unique()
2. job 별 개수 확인 :  value_counts()

In [136]:
df.value_counts()

name  age   job  hobby
이영자   45.0  상담사  talk     1
유재석   41.0  교수   art      1
신동엽   32.4  연예인  music    1
      20.0  연예인  music    1
김새롬   18.0  학생   study    1
강호동   38.0  연예인  talk     1
dtype: int64

In [139]:
# value_counts() : 데이터별 개수 counting

df['job'].value_counts()

연예인    3
상담사    1
학생     1
교수     1
Name: job, dtype: int64

In [140]:
# 취미별 grouping 후에 연산이 가능한 Series의 값의 합을 자동 도출
df.groupby('hobby').sum()

        age
hobby
art    41.0
music  52.4
study  18.0
talk   83.0

In [142]:
# select distinct job from emp:

df['job'].unique()

array(['연예인', '교수', '학생', '상담사'], dtype=object)

In [148]:
# np.nan : 결측치 표현
# test 를 위해서 결측치 추가

df.iloc[5, 1] = np.nan

In [149]:
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [152]:
df.groupby('job')

In [151]:
df.groupby('job')['age']

In [156]:
# 결측치를 중앙값(데이터를 오름차순으로 나열해서 가운데 값을 의미)
# 치환
# job 별로 그룹핑/그룹핑되어 있는 job별로 각 중앙값 도출
# /그 중앙값으로 변환

# 중앙값 특징 : 흡수라면 정말 정 중앙 의미
# 짝수인 경우 중앙 두개의 데이터 더하고 나누기 2한 데이터 값이 중앙값

# 전체 나열했을 경우 - 18.0 29.0 29.0 41.0 45.0
# job별로 그룹핑 후 - job 별 중앙값으로 치환(transform)
df['age'] = df.groupby('job')['age'].transform('median')
df

  name   age  job  hobby
0  신동엽  29.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  29.0  연예인   talk
5  신동엽  29.0  연예인  music

In [155]:
df['age'] = df.groupby('job')['hobby'].transform('median')
df

DataError: No numeric types to aggregate

In [157]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name':  '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby': 'music'},
                    {'name': '가', 'age': 2, 'job': '연예인', 'hobby': 'music'},
                    {'name': '나', 'age': 4, 'job': '연예인', 'hobby': 'art'},
                    {'name': '다', 'age': 50, 'job': '연예인', 'hobby': 'music'},
                    {'name': '라', 'age': 54, 'job': '연예인', 'hobby': 'art'},
                    {'name': '마', 'age': 57, 'job': '연예인', 'hobby': 'art'}
                    ]

df = pd.DataFrame(friend_dict_list)
df

   name   age  job  hobby
0   신동엽  20.0  연예인  music
1   유재석  41.0   교수    art
2   김새롬  18.0   학생  study
3   이영자  45.0  상담사   talk
4   강호동  38.0  연예인   talk
5   신동엽   NaN  연예인  music
6     가   2.0  연예인  music
7     나   4.0  연예인    art
8     다  50.0  연예인  music
9     라  54.0  연예인    art
10    마  57.0  연예인    art

In [158]:
연예인 데이터에 한해서만 오름차순 정렬

2, 4, 20, 38, 50, 54, 57

SyntaxError: invalid syntax (<ipython-input-158-aae1e1493b62>, line 1)

In [159]:
df['age'] = df.groupby('job')['age'].transform('median')
df

   name   age  job  hobby
0   신동엽  38.0  연예인  music
1   유재석  41.0   교수    art
2   김새롬  18.0   학생  study
3   이영자  45.0  상담사   talk
4   강호동  38.0  연예인   talk
5   신동엽  38.0  연예인  music
6     가  38.0  연예인  music
7     나  38.0  연예인    art
8     다  38.0  연예인  music
9     라  38.0  연예인    art
10    마  38.0  연예인    art

In [ ]:
# 데이터 제공
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
                    {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
                    {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name': '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby': 'music'},
                    {'name': '고현정', 'age': 44, 'job': '가수', 'hobby': 'music'},
                    {'name': '박민영', 'age': 22, 'job': '학생', 'hobby': 'art'},
                    {'name': '박서준', 'age': 18, 'job': '학생', 'hobby': 'study'},
                    {'name': '박보검', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
                    {'name': '이효리', 'age': 28, 'job': '교수', 'hobby': 'talk'},
                    {'name': '이상순', 'age': 29, 'job': '주부', 'hobby': 'music'}]

df = pd.DataFrame(friend_dict_list)
df

### 조건 기반 필터링

- Pandas의 비교 및 논리 연산자
- 비교 연산자는 기본 연산자를 사용
- AND : &
- OR : |
- NOT : ~ (틸드)
- 논리 연산에 기본 연산자를 사용할 경우 객체
전체의 참을 계산하기 때문에 오류 발생
- 각 표현은 괄호로 묶는 것은 권장

In [ ]:
# == 값의 동등비교
df.name == '신동엽'

In [162]:
f1 = df.name == '김새롬'
f2 = df.job == '학생'

f1 & f2

0     False
1     False
2      True
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

In [169]:
# True 값을 보유한
df2 = df[f1 & f2]

In [170]:
df2

  name   age job  hobby
2  김새롬  18.0  학생  study

In [168]:
print(type(df.hobby))

<class 'pandas.core.series.Series'>

<hr>

**미션**

1. hobby 종류 확인 : unique()로 list 변환
2. hobby 종류의 총수 확인 : unique()의 결과를 len()으로 개수 확인
3. 종류별 개수 : value_counts()로 범주별 counting

In [181]:
print(df.hobby.unique())        # ['music' 'art' 'study' 'talk']
print(len(df.hobby.unique()))   # 4
print(df.hobby.value_counts())

['music' 'art' 'study' 'talk']
4
music    2
talk     2
art      1
study    1
Name: hobby, dtype: int64

### 두개의 DataFrame 병합하기 - row 기준

In [171]:
l1 = [{'name': '이효리', 'job': "교수"},
      {'name': '이상순', 'job': "학생"},
      {'name': '박보검', 'job': "개발자"}]

l2 = [{'name': '신동엽', 'job': "치과의사"},
      {'name': '이영자', 'job': "농부"},
      {'name': '정찬우', 'job': "연예인"}]

In [172]:
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

print(df1)
print(type(df1))
print(df1.ndim)    # 2 차원 즉 2차원
print(df1.shape)   # (3, 2) 즉 3행 2열

print('-'*20)

print(df2)

  name  job
0  이효리   교수
1  이상순   학생
2  박보검  개발자
<class 'pandas.core.frame.DataFrame'>
2
(3, 2)
--------------------
  name   job
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [173]:
# 두개의 DataFrame을 하나로 결합(merge)

df_all = pd.concat([df1, df2])
df_all

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [174]:
# 두개의 DataFrame이 좌우로 결합
# axis = 1 : 컬럼 즉 Series를 추가 하는 구조로 결합

df_all = pd.concat([df1, df2], axis=1)
df_all

  name  job name   job
0  이효리   교수  신동엽  치과의사
1  이상순   학생  이영자    농부
2  박보검  개발자  정찬우   연예인

In [176]:
# 두개의 DataFrame이 상하로 결합, row들을 증가하는 구조
# axis = 0

df_all = pd.concat([df1, df2], axis=0)
df_all

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [177]:
# index의 재 정리가 필요
# ignore_index=True 기존 index의 설정은 무시하고 새롭게 재 정리하는 구조

df_all = pd.concat([df1, df2], axis=0, ignore_index=True)
df_all

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
3  신동엽  치과의사
4  이영자    농부
5  정찬우   연예인